﻿<?php
/**
 * @package fuel_life
 * @version 1.6
 */
/*
Plugin Name: وقود الحياة!
Plugin URI: http://wordpress.org/extend/plugins/fuel-of-life///
Description: برمجة خاصة من  <site>عالم بيري </site> وهي عبارة عن إضافة لحكم ومقولات وبعض الاذكار وسميت وقود الحياة لان البعض ربما يكون محبط ونفذ منه الأمل .
Author: عالم بيري
Version: 0.0.1
Author URI: http://w0rld-b.com/
*/

function fuel_life_get_lyric() {
	/** These are the lyrics to fuel of life */
	$lyrics = "fuel, life
لاتنسى ذكر الله
لا إله إلا الله واشهد ان محمد رسول الله
لاتنسى ان كل ماتفعله بموقعك انت محاسب عليه 
حــــاول و افـشــل،لكن إياك أن تتوقف عن المحاولة.
في بعض الأحيان،يكون عدم حصولك على ما تطلبه هو هبة من السماء تعرف قيمتها فيما بعد.
مهما حرصت على حسن انتقاء كلماتك،ستجد دوما من يسيء تفسيرها على غير ما تقصد. لذا قل ما يجب عليك قوله.
لا شيء يمنعك من التقدم للأمام سواك أنت.هناك دوما سؤال واحد فقط تسأله لنفسك: ماذا كنت لأفعل لو لم أكن خائفا؟ فكر دائما في هذا السؤال.
إذا كنت شغوفا بحلم ما، اجتهد حتى تجعله يتحول لحقيقة،مـــهـــمـــا نصحك الآخـــرون بـغـيـر ذلك،فهكذا يتحول الحلم إلى حقيقة.
أنا لا أخشى الـعـواصـف لأني أتعلم كيف أبحر بـسـفـيــنـتـي.
الـفـُرص مـثـل شـروق الـشـمـس، إذا انـتـظـرت طـويـلا فـقـد يـفـوتـك. 
إذا أردت أن تفعلها حقا، ستجد وسيلة. إذا لم ترد، ستجد عذرا
الـشـتـاء يـنـتـهـي دائـمـا بـالـربـيـع
إذا أردت بلوغ مـكـان فـوق الـشـمـس، فعليك أن تتحمل بعض الخدوش والجروح الصغيرة
لا تـحـسـب كـم حـصـدت فـي يـومـك، بــــل احـسـب كـم زرعـــت
تؤلمنا الأخطاء حين نقع فيها، لكن بعدها بسنوات، مجموع أخطائك هو ما نسميه الخبرة
لن تمطر السماء ورودا، حين نريد المزيد من الورود، علينا زراعة المزيد منها
وقتك محدود فلا تضيعه في أن تعيش حياة شخص آخر. لا تقع في فخ العيش وفق ما توصل إليه فكر الآخرين. لا تدع الضوضاء التي تحدثها آراء الآخرين تعلو فوق صوتك الداخلي
لا تـخـش الـخـروج مـن مـنـطـقـة الأمـان والـتـعـود، فـبـعـض أفـضـل خـبرات حـيـاتـك وفـرصـهـا سـتـأتـي بـعـدمـا تـتـجـرأ عـلـى الـخـسـارة.
الرجـل الـذي نـقـل الـجـبـل مـن مـكـانـه هـو مـن بـدأ بـنـقـل اﻷحـجـار الـصـغـيـرة
لا تـقـلـق كـثـيـرا بـشـأن الـمـاضـي، ولا تـحـمـل هـم الـغـد. الآن هـو حـيـاتـك، عـِشـهـا.
مـهـمـا كـان عـدد الأخـطـاء الـتـي وقـعـت فـيـهـا، مـهـمـا كـان تـقـدمـك بـطـيـئا، فأنـت تـسـبـق مـن لا يـحـاولـون فـعـل أي شـيـئ.
كوني أغنى رجل في المقبرة لا يهمني، ما يهمني حقا هو أن أذهب لأنام في سريري وأنا أقول لنفسي لقد فعلت شيئا رائعا في يومي هذا
كل دقيقة تعيشها هي هدية، لذا أنفقها على الأشياء التي تستحق، لكن لا تنفقها في التفكير في الأشياء المحزنة.
الـكـثـيـرون مـنـا لا يـعـيـشـون أحـلامـهـم، لأنـهـم يـعـيـشـون مـخـاوفـهـم بـدلا منهــا
لا يـسـتـطـيـع أحـد أن يـعـود لـلـمـاضـي، لذا تـطـلـع لـلأمـام، فـهـنـاك يـنـتـظـرك مـسـتـقـبـلـك
اجـعـل أحـلامـك – ولـيـس آلامـك – هـي الـتـي تـشـكـل مـسـتـقـبـلـك
سامح أعدائك دائما، لا شيء يضايقهم أكثر من فعلك ذلك
النجاح هو أن تتعلم كيف تصطاد السمك
لا تـتـكـلـم قـلـيـلا عـن أمـور شـتـى، بـل تـكـلـم كـثـيـرا عـن أمـور قـلـيـلـة
أيـنـمـا ذهـبـت، وكـيـفـما كان الـطـقـس، فـاحـرص دائـمـا عـلـى أن تـصـطـحـب مـعـك ضـوء الـشـمـس الـخـاص بـك";

	// Here we split it into lines
	$lyrics = explode( "\n", $lyrics );

	// And then randomly choose a line
	return wptexturize( $lyrics[ mt_rand( 0, count( $lyrics ) - 1 ) ] );
}

// This just echoes the chosen line, we'll position it later
function fuel_life() {
	$chosen = fuel_life_get_lyric();
	echo "<p id='fuel_life'>$chosen</p>";
}

// Now we set that function up to execute when the admin_notices action is called
add_action( 'admin_notices', 'fuel_life' );

// We need some CSS to position the paragraph
function fuel_life_css() {
	// This makes sure that the positioning is also good for right-to-left languages
	$x = is_rtl() ? 'left' : 'right';

	echo "
	<style type='text/css'>
	#fuel_life {
		float: $x;
		padding-$x: 15px;
		padding-top: 5px;		
		margin: 0;
		font-size: 11px;
	}
	</style>
	";
}

add_action( 'admin_head', 'fuel_life_css' );

?>
